compiled/RECIPE.1.8.4/META-INF/external/WSDL/PdpService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="pdpDefinition" targetNamespace="http://www.smals.be/uam/3.0/pdp/service" xmlns:pdp="http://www.smals.be/uam/3.0/pdp/service" xmlns:xacml-samlp="urn:oasis:xacml:2.0:saml:protocol:schema:os" xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:xacml-saml="urn:oasis:xacml:2.0:saml:assertion:schema:os" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns="http://schemas.xmlsoap.org/wsdl/">
	<types>
		<xsd:schema targetNamespace="http://www.smals.be/uam/3.0/pdp/service">
			<xsd:import namespace="urn:oasis:names:tc:SAML:2.0:protocol" schemaLocation="../XSD/saml-schema-protocol-2.0.xsd"/>
			<xsd:import namespace="urn:oasis:xacml:2.0:saml:protocol:schema:os" schemaLocation="../XSD/access_control-xacml-2.0-saml-protocol-schema-os.xsd"/>
			<xsd:import namespace="urn:oasis:xacml:2.0:saml:assertion:schema:os" schemaLocation="../XSD/access_control-xacml-2.0-saml-assertion-schema-os.xsd"/>
		</xsd:schema>
	</types>
	<message name="getDecision">
		<part name="inDecisionRequest" element="xacml-samlp:XACMLAuthzDecisionQuery"/>
	</message>
	<message name="getDecisionResponse">
		<part name="outDecisionResponse" element="samlp:Response"/>
	</message>
	<portType name="pdpServicePortType">
		<operation name="getDecision" parameterOrder="inDecisionRequest">
			<input message="pdp:getDecision"/>
			<output message="pdp:getDecisionResponse"/>
		</operation>
	</portType>
	<binding name="pdpServiceBinding" type="pdp:pdpServicePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="getDecision">
			<soap:operation style="document" soapAction="getDecision"/>
			<input>
				<soap:body use="literal" parts="inDecisionRequest"/>
			</input>
			<output>
				<soap:body use="literal" parts="outDecisionResponse"/>
			</output>
		</operation>
	</binding>
	<service name="pdpService">
		<port name="pdpServicePort" binding="pdp:pdpServiceBinding">
			<soap:address location="http://localhost/PDPService"/>
		</port>
	</service>
</definitions>
